routes/Finance.php

select * from `provisions` where `provisions`.`deleted_at` is null
select * from `groups`
---
use Illuminate\Http\Request;

route::post('addProvision',[\App\Http\Controllers\FinanceController::class,'addProvision'])->name('addProvision')->middleware('role:admin|backoffice');
route::get('finance',function (Request $req){
    $groups = \App\Models\Group::get();

    if(isset($req->date)){

    $provisions = \App\Models\Provisions::where('from','>=',Carbon\Carbon::createFromFormat('Y-m',substr($req->date,0,7))->format('Y-m'))->get();
}
    else{
        $provisions = \App\Models\Provisions::where('from','>=',Carbon\Carbon::now()->subDays(30)->format('Y-m'))->get();
    }
    $admins = \App\Models\Admins::role(['fs'])->get();
    return view('finance',compact('admins','groups','provisions'));
})->name('finance')->middleware('role:admin|backoffice');

select * from `companies` where `prov_id` = '1'
---
    return redirect()->back();
})->name('provision.delete')->middleware('role:admin');
route::post('addGroup',[\App\Http\Controllers\FinanceController::class,'addGroup'])->name('addGroup')->middleware('role:admin');
route::get('finstatus/{id}',function ($id){
    $companies = \App\Models\Companies::where('prov_id',$id)->get();

    return view('finstatus',compact('companies','id'));
})->name('finstatus')->middleware('role:admin');