routes/Hr.php

select * from `costumer_produkt_grundversicherung` where `admin_id` = 4 and `status_PG` in ('Provisionert')
---
            $date_in = $input['date_in'];} else { $date_in = date('Y-m-d');
        }
        $contracts = collect();
        foreach (\App\Models\CostumerProduktGrundversicherung::where('admin_id',auth()->id())->whereIn('status_PG',['Provisionert'])->get() as $produkt){

select * from `costumer_produkt_rechtsschutz` where `admin_id` = 4 and `status_PR` in ('Provisionert')
---
        foreach (\App\Models\CostumerProduktZusatzversicherung::where('admin_id',auth()->id())->whereIn('status_PZ',['Provisionert'])->get() as $produkt){
            $contracts->push(['val' => $produkt->total_commisions_PZ,'field' => 'Zusat','company' =>$produkt->society_PZ,'prov_id' => $produkt->prov_id]);
        }
        foreach (\App\Models\CostumerProduktRechtsschutz::where('admin_id',auth()->id())->whereIn('status_PR',['Provisionert'])->get() as $produkt){

select * from `admins` where `admins`.`id` in (3, 4) and `admins`.`deleted_at` is null
---

        if($user->hasRole('admin')  || $user->hasRole('backoffice')){
            $date_in =  new DateTime($date_in);
            $absences = Absence::whereHas('admin')->with('admin')->orderBy('created_at', 'desc')->get();

select * from `absences` where exists (select * from `admins` where `absences`.`employee_id` = `admins`.`id` and `admins`.`deleted_at` is null) and `employee_id` = 4 order by `created_at` desc
select * from `admins` where `admins`.`id` in (4) and `admins`.`deleted_at` is null
---
            $bestellungen = bestellungen::orderBy('created_at', 'desc')->get();
        } else{
            $date_in =  new DateTime($date_in);
            $absences = Absence::whereHas('admin')->with('admin')->where('employee_id',auth()->user()->id)->orderBy('created_at', 'desc')->get();

select * from `admins` where `admin_id` is null and `admins`.`deleted_at` is null
select * from `employee_personal_data` where `employee_personal_data`.`admin_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 14, 19, 25, 26)
---
            $bestellungen = bestellungen::where('employee_id',auth()->user()->id)->orderBy('created_at', 'desc')->get();
        }
        if ($request->searchEmployes == null){
            $admins = \App\Models\Admins::with('personaldata')->where('admin_id', null)->get();

select * from `admins` where `admins`.`id` = 4 and `admins`.`deleted_at` is null limit 1
select * from `employee_personal_data` where `admin_id` = 4 limit 1
select * from `employee_personal_data` where `admin_id` = 4
select * from `bank_information` where `employee_id` = 4 limit 1
select * from `employee_personal_data` where `admin_id` = 1
select * from `bank_information` where `employee_id` = 1 limit 1
---
            $admins = \App\Models\Admins::where('name', 'LIKE', '%'.$request->searchEmployes.'%')->with('personaldata')->where('admin_id', null)->get();
        }

        $admini = Admins::find(auth()->user()->id);
        if($admini->admin_id == null){
            $personalData = EmployeePersonalData::where('admin_id',auth()->user()->id)->first();
            $personalDatas = EmployeePersonalData::where('admin_id',auth()->user()->id)->get();
            $bankInfo = \App\Models\BankInformation::where('employee_id',auth()->user()->id)->first();

        }else{
            $personalDatas = EmployeePersonalData::where('admin_id',auth()->user()->headadmin->id)->get();
            $personalData = EmployeePersonalData::where('admin_id',auth()->user()->headadmin->id)->first();
            $bankInfo = \App\Models\BankInformation::where('employee_id',auth()->user()->headadmin->id)->first();

select * from `employee_personal_data` where `admin_id` = '1' limit 1
select * from `bank_information` where `employee_id` = '1' limit 1
select * from `admins` where `admins`.`id` = '1' and `admins`.`deleted_at` is null limit 1
select * from `costumer_produkt_grundversicherung` where `admin_id` = '1' and `status_PG` in ('Provisionert')
---
    route::post('updateinfo',[HumanResourcesController::class,'updateinfo'])->name('updateinfo');
    route::get('employeProfile/{id}',function ($id){

        $personalData = EmployeePersonalData::where('admin_id',$id)->first();
        $bankInfo = \App\Models\BankInformation::where('employee_id',$id)->first();
        $person = Admins::find($id);
        $contracts = collect();
        foreach (\App\Models\CostumerProduktGrundversicherung::where('admin_id',$id)->whereIn('status_PG',['Provisionert'])->get() as $produkt){