routes/web.php

        $urole = $user->getRoleNames();

        if ($urole->contains('admin') || $urole->contains('salesmanager')) {
            $leads['leads'] = lead::with('campaign')->with('info')->where('completed', '0')->where('assigned', 0)->where('assign_to_id', null)->where('wantsonline',0)->where('rejected',0)->orderBy('updated_at','asc')->paginate(100);
---
select count(*) as aggregate from `leads` where `completed` = '0' and `assigned` = 0 and `assign_to_id` is null and `wantsonline` = 0 and `rejected` = 0 and `leads`.`deleted_at` is null

            $item->notify(new SendNotificationn('<a href="' . route('Appointments') .'">Ein Termin von ' . lead::find($id)->admin->name . ' bei ' .  lead::find($id)->name . ' wurde auf den '. $req->ndate . 'verschoben</a>'));});
        return redirect()->route('dashboard');
    })->name('folgepost');
    route::get('acceptappointment/{id}',function ($id){
        $lead = lead::find($id);
        return view('acceptappointment',compact('lead'));
    })->name('acceptappointment');
---
select * from `leads` where `leads`.`id` = '2' and `leads`.`deleted_at` is null limit 1

    route::get('linkthat/{id}/{pid}','App\Http\Controllers\FamilyPersonsController@linkthat');
    route::get('updateperson/{id}',[UserController::class,'updateperson'])->name('updateperson');

    route::get('rejectedAppointment', function(){
        $leads = lead::whereNotNull('assign_to_id')->withTrashed()->get();
        return view('rejectedappointment', compact('leads'));
    })->name('rejectedAppointment');
---
select * from `leads` where `assign_to_id` is not null

    route::post('editclientform/{id}',[StatusController::class,'editclientform'])->name('editclientform');

    route::get('editclientdata/{id}',[StatusController::class,'editclientdata'])->name('editclientdata');
    route::get('rleads',[UserController::class,'rleads'])->name('rleads');
    route::get('leadhistory',function(Request $request){
        if(!Auth::user()->hasRole('fs')){
            $leads = lead::with('info')->with('admin')->orderBy('created_at','desc')->withTrashed()->get();
        }
        else{
            $leads = lead::with('info')->with('admin')->where('assign_to_id',Auth::user()->id)->orderBy('created_at','desc')->withTrashed()->get();
        }
        return view('leadshistory',compact('leads'));
    })->name('leadshistory');
---
select * from `leads` order by `created_at` desc
select * from `admins` where `admins`.`id` in (4, 5, 9, 18) and `admins`.`deleted_at` is null
select * from `lead_info` where `lead_info`.`lead_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)