resources/helpers.php

select * from `companies` where `company_name` = '' and `field` = 'Grund' and `prov_id` = 0 limit 1
---
    function findgrund($com,$model,$val){
       $per = \App\Models\Companies::where('company_name',$com)->where('field',$model)->where('prov_id',auth()->user()->provision->id)->first();