app/Http/Controllers/CostumerFormController.php

select `status_PG`, `last_adjustment_PG` from `costumer_produkt_grundversicherung` where `person_id_PG` = 1 limit 1
select * from `costumer_produkt_grundversicherung` where `person_id_PG` = 1 limit 1
update `costumer_produkt_grundversicherung` set `graduation_date_PG` = '1990-03-15', `society_PG` = 'Sympany', `product_PG` = 'Consequuntur volupta', `status_PG` = 'Eingereicht', `last_adjustment_PG` = '2022-06-27', `total_commisions_PG` = 0, `prov_id` = 0, `costumer_produkt_grundversicherung`.`updated_at` = '2022-06-27 12:38:28' where `person_id_PG` = 1
select * from `admins` where `admins`.`id` = 6 and `admins`.`deleted_at` is null limit 1
---
    public function edit_costumer_kundportfolio(Request $request, $id){

        $id = Crypt::decrypt($id) / 1244;
        $aufcnt = 0;
        $provcnt = 0;

        $statusGrund = CostumerProduktGrundversicherung::select('status_PG','last_adjustment_PG')->where('person_id_PG',$id)->first();

        if ($request->status_PG != $statusGrund->status_PG){
            if ($statusGrund->status_PG == null){
                $todayG = $statusGrund->last_adjustment_PG;
            }else{
                $todayG = Carbon::now()->format('Y/m/d');
            }
        }else{
            $todayG = $statusGrund->last_adjustment_PG;
        }

        $table_PG = null;
        if($request->status_PG == 'Storniert'){
            $table_PG =  'stoiner_PG';
        }else{
            $table_PG = 'status_PG';
        }

        $lgrund = CostumerProduktGrundversicherung::firstWhere('person_id_PG',$id);
        $grund = CostumerProduktGrundversicherung::where('person_id_PG',$id)->update([
                'graduation_date_PG' => $request->graduation_date_PG,
                'society_PG' => filter_var($request->society_PG,FILTER_SANITIZE_STRING),
                'product_PG' => filter_var($request->product_PG,FILTER_SANITIZE_STRING),
                 $table_PG => filter_var($request->status_PG,FILTER_SANITIZE_STRING),
                'last_adjustment_PG' => $todayG,
                'total_commisions_PG' => (int) filter_var($request->total_commisions_PG,FILTER_SANITIZE_STRING),
                'prov_id' => $lgrund->prov_id ? $lgrund->prov_id : Admins::find($lgrund->admin_id)->provision->id
        ]);

update `pendencies` set `completed` = 1, `pendencies`.`updated_at` = '2022-06-27 12:38:28' where `family_id` = 1 and `pendencies`.`deleted_at` is null
select `status_PR`, `last_adjustment_PR` from `costumer_produkt_rechtsschutz` where `person_id_PR` = 1 limit 1
---
            $aufcnt++;
        }
        elseif ($request->status_PG == 'Eingereicht'){
            $affected = Pendency::where('family_id', $id)->update(array('completed' => 1));
        }


        $statusRech = CostumerProduktRechtsschutz::select('status_PR','last_adjustment_PR')->where('person_id_PR',$id)->first();

select * from `costumer_produkt_rechtsschutz` where `person_id_PR` = 1 limit 1
update `costumer_produkt_rechtsschutz` set `graduation_date_PR` = '', `society_PR` = '', `produkt_PR` = '', `status_PR` = '', `last_adjustment_PR` = '2022-06-27', `total_commisions_PR` = 0, `prov_id` = 0, `costumer_produkt_rechtsschutz`.`updated_at` = '2022-06-27 12:38:28' where `person_id_PR` = 1
select * from `admins` where `admins`.`id` = 6 and `admins`.`deleted_at` is null limit 1
---
        }else{
            $table_PR = 'status_PR';
        }
        $lretchsschutzP = CostumerProduktRechtsschutz::firstWhere('person_id_PR',$id);
        $retchsschutzP = CostumerProduktRechtsschutz::where('person_id_PR',$id)->update([
            'graduation_date_PR'=> $request->graduation_date_PR,
            'society_PR' => filter_var($request->society_PR,FILTER_SANITIZE_STRING),
            'produkt_PR'=> filter_var($request->produkt_PR,FILTER_SANITIZE_STRING),
             $table_PR=> filter_var($request->status_PR,FILTER_SANITIZE_STRING),
            'last_adjustment_PR'=> $todayR,
            'total_commisions_PR'=> (int) filter_var($request->total_commisions_PR,FILTER_SANITIZE_STRING),
            'prov_id' => $lretchsschutzP->prov_id ? $lretchsschutzP->prov_id : Admins::find($lretchsschutzP->admin_id)->provision->id
        ]);

select `status_PV`, `last_adjustment_PV` from `costumer_produkt_vorsorge` where `person_id_PV` = 1 limit 1
---
            $affected = Pendency::where('family_id', $id)->update(array('completed' => 1));
        }

        $statusVor = CostumerProduktVorsorge::select('status_PV','last_adjustment_PV')->where('person_id_PV',$id)->first();

select * from `costumer_produkt_vorsorge` where `person_id_PV` = 1 limit 1
update `costumer_produkt_vorsorge` set `graduation_date_PV` = '4010-11-24', `begin_PV` = '2195-11-01', `society_PV` = 'Axa', `pramie_PV` = 'Consequat Qui quia', `payment_rythm_PV` = 'Quartalsweise', `duration_from_PV` = '2409-08-26', `duration_to_PV` = '5595-12-02', `production_PV` = 'Excepturi adipisci u', `status_PV` = 'Eingereicht', `last_adjustment_PV` = '2022-06-27', `total_commisions_PV` = 0, `prov_id` = 0, `costumer_produkt_vorsorge`.`updated_at` = '2022-06-27 12:38:28' where `person_id_PV` = 1
select * from `admins` where `admins`.`id` = 6 and `admins`.`deleted_at` is null limit 1
---
        }else{
            $table_PV = 'status_PV';
        }
        $lvorsorgeP = CostumerProduktVorsorge::firstWhere('person_id_PV',$id);

        $vorsorgeP = CostumerProduktVorsorge::where('person_id_PV',$id)->update([
            'graduation_date_PV'=> $request->graduation_date_PV,
            'begin_PV' => $request->begin_PV,
            'society_PV'=> filter_var($request->society_PV,FILTER_SANITIZE_STRING),
            'pramie_PV'=> filter_var($request->pramie_PV,FILTER_SANITIZE_STRING),
            'payment_rythm_PV'=> filter_var($request->payment_rythm_PV,FILTER_SANITIZE_STRING),
            'duration_from_PV'=>  $request->duration_from_PV,
            'duration_to_PV'=> $request->duration_to_PV,
            'production_PV'=> filter_var($request->production_PV,FILTER_SANITIZE_STRING),
             $table_PV => filter_var($request->status_PV,FILTER_SANITIZE_STRING),
            'last_adjustment_PV'=> $todayV,
            'total_commisions_PV'=> (int) filter_var($request->total_commisions_PV,FILTER_SANITIZE_STRING),
            'prov_id' => $lvorsorgeP->prov_id ? $lvorsorgeP->prov_id : Admins::find($lvorsorgeP->admin_id)->provision->id
        ]);

update `pendencies` set `completed` = 1, `pendencies`.`updated_at` = '2022-06-27 12:38:28' where `family_id` = 1 and `pendencies`.`deleted_at` is null
select `status_PA`, `last_adjustment_PA` from `costumer_produkt_autoversicherung` where `person_id_PA` = 1 limit 1
---
            $aufcnt++;
        }
        elseif ($request->status_PV == 'Eingereicht'){
            $affected = Pendency::where('family_id', $id)->update(array('completed' => 1));
        }

        $statusAuto = CostumerProduktAutoversicherung::select('status_PA','last_adjustment_PA')->where('person_id_PA',$id)->first();

select * from `costumer_produkt_autoversicherung` where `person_id_PA` = 1
---
        }

        $pcnt = 1;
        foreach (CostumerProduktAutoversicherung::where('person_id_PA',$id)->get() as $objekt){

select `status_PH`, `last_adjustment_PH` from `costumer_produkt_hausrat` where `person_id_PH` = 1 limit 1
---
            $affected = Pendency::where('family_id', $id)->update(array('completed' => 1));
        }

        $statusHaus = CostumerProduktHausrat::select('status_PH','last_adjustment_PH')->where('person_id_PH',$id)->first();

update `costumer_produkt_hausrat` set `society_PH` = 'Axa', `beginning_insurance_PH` = '7240-04-11', `insurance_PH` = 'Fugiat minima totam', `status_PH` = 'Aufgenommen', `last_adjustment_PH` = '2022-06-27', `total_commisions_PH` = 0, `costumer_produkt_hausrat`.`updated_at` = '2022-06-27 12:38:28' where `person_id_PH` = 1
---
        }else{
            $table_PH = 'status_PH';
        }
        $hausratP = CostumerProduktHausrat::where('person_id_PH',$id)->update([
            'society_PH'=> filter_var($request->society_PH,FILTER_SANITIZE_STRING),
            'beginning_insurance_PH' => $request->beginning_insurance_PH,
            'insurance_PH'=> filter_var($request->insurance_PH,FILTER_SANITIZE_STRING),
            $table_PH => filter_var($request->status_PH,FILTER_SANITIZE_STRING),
            'last_adjustment_PH'=> $todayH,
            'total_commisions_PH'=> (int) filter_var($request->total_commisions_PH,FILTER_SANITIZE_STRING),
        ]);

update `pendencies` set `completed` = 1, `pendencies`.`updated_at` = '2022-06-27 12:38:28' where `family_id` = 1 and `pendencies`.`deleted_at` is null
---
            $aufcnt++;
        }
        elseif ($request->status_PG == 'Eingereicht'){
            $affected = Pendency::where('family_id', $id)->update(array('completed' => 1));

select * from `admins` where `admins`.`id` = 6 and `admins`.`deleted_at` is null limit 1
---
            'last_adjustment_PZ' => $todayZ,
            'provision_PZ' => filter_var($request->provision_PZ,FILTER_SANITIZE_STRING),
            'total_commisions_PZ' => (int) filter_var($request->total_commisions_PZ,FILTER_SANITIZE_STRING),
            'prov_id' => $lzusat->prov_id ? $lzusat->prov_id : Admins::find($lzusat->admin_id)->provision->id