app/Http/Controllers/FinanceController.php

select * from `companies` where (`company_name` = 'Helsana' and `field` = 'Zusat' and `prov_id` = '1') limit 1
insert into `companies` (`company_name`, `provision_percent`, `field`, `prov_id`, `updated_at`, `created_at`) values ('Helsana', '65', 'Zusat', '1', '2022-06-27 09:52:14', '2022-06-27 09:52:14')
---
    public function register($id,$field,Request $req){
        $cnt = (int) $req->cnt;

        for ($i = 1; $i <= $cnt; $i++){
            if(!Companies::firstWhere(['company_name' => $req->input('company' . $i),'field' => $field,'prov_id' => $id])){
                if($req->input('company' . $i) != null && $req->input('percent' . $i) != null){
            Companies::create(['company_name' => $req->input('company' . $i),'provision_percent' => $req->input('percent' . $i),'field' => $field,'prov_id' => $id]);

select * from `companies` where `companies`.`id` = '37' limit 1
update `companies` set `provision_percent` = '65', `companies`.`updated_at` = '2022-06-21 16:00:16' where `id` = 37
---
public function updatecompany($id,Request $req){

       Companies::find($id)->update(['provision_percent' => $req->percent]);