app/Http/Controllers/HumanResourcesController.php

select * from `absences` where `employee_id` = 4 order by `created_at` desc limit 1
insert into `absences` (`employee_id`, `from`, `to`, `file`, `type`, `description`, `updated_at`, `created_at`) values (4, '2022-06-14', '2022-06-21', '', 1, 'Urlaub', '2022-06-23 08:28:40', '2022-06-23 08:28:40')
---
    public function createAbsence(Request $request)
    {
        $decryptedEmployeeId = $request->employeeId;
        $emp  = auth()->user();
        $created_at =  Carbon::createFromFormat('Y-m-d',$request->from);
        $duration_time = Carbon::createFromFormat('Y-m-d',$request->to);

        $absence = Absence::where('employee_id', $emp->id)->latest()->first();

        if($absence == null || $absence->to < Carbon::now()){
            $duration =  (int) date_diff($created_at,$duration_time)->format('%d');
            if($duration > 7) $type = 0; else $type = 1;

            $absence = new Absence();
            $absence->employee_id = $emp->id;
            $absence->from = $request->from;
            $absence->to = $request->to;
            $absence->file = $request->hasFile('begrundungfile2') ? $this->storeFile($request->file('begrundungfile2'),FolderPaths::KK_FILES) : null;
            $absence->type = $type;

            if ($request->descriptionSelect != null) {
                $absence->description = $request->descriptionSelect;
            }else {
                $absence->description = $request->description;
            }
            $absence->save();