app/Http/Controllers/LeadDataController.php

select * from `costumer_produkt_grundversicherung` where `person_id_PG` = 4
select * from `costumer_produkt_rechtsschutz` where `person_id_PR` = 4 limit 1
select * from `costumer_produkt_vorsorge` where `person_id_PV` = 4 limit 1
select * from `costumer_produkt_hausrat` where `person_id_PH` = 4 limit 1
select * from `costumer_produkt_autoversicherung` where `person_id_PA` = 4
---
    public function acceptdata($id, Request $req,$accept = false)
    {
        $id = Crypt::decrypt($id) / 1244;

        $admin_id = $req->admin_id;

        $user = Auth::user();
        $urole = $user->getRoleNames()->toArray();

        $cid = Crypt::decrypt($req->admin_id);
        if(is_string($cid)){
            $admin_id = Crypt::decrypt($cid) / 1244;
        }
        else{
            $admin_id = $cid / 1244;
        }

        $lead = family::find($id);

        if (!in_array('fs',$urole) || Pendency::find(Session::get('pend_id'))->admin_id == $user->id) {
            if (!$accept) {
                $data = new data();
                $data->getdata($id);
                $grundversicherungP = CostumerProduktGrundversicherung::where('person_id_PG', $id)->get();
                $retchsschutzP = CostumerProduktRechtsschutz::where('person_id_PR', $id)->first();
                $vorsorgeP = CostumerProduktVorsorge::where('person_id_PV', $id)->first();
                $zusatzversicherungP = CostumerProduktZusatzversicherung::where('person_id_PZ', $id)->first();
                $hausratP = CostumerProduktHausrat::where('person_id_PH', $id)->first();
                $autoversicherungP = CostumerProduktAutoversicherung::where('person_id_PA', $id)->get();

update `pendencies` set `completed` = 1, `pendencies`.`updated_at` = '2022-06-27 12:03:07' where `family_id` = 1 and `pendencies`.`deleted_at` is null
select `status_PG`, `last_adjustment_PG` from `costumer_produkt_grundversicherung` where `person_id_PG` = 1 limit 1
select * from `costumer_produkt_grundversicherung` where `person_id_PG` = 1
---
    public function updateLeadDataKK($leadId, $personId, Request $request,$vorsorge = false)
    {


        $id = Crypt::decrypt($personId) / 1244;
        family::find($id)->update(['first'=> 0]);
        $aufcnt = 0;
        $provcnt = 0;
        $pcnt = 1;

        Pendency::where('family_id',$id)->update(array('completed'=>1));
        $statusGrund = CostumerProduktGrundversicherung::select('status_PG','last_adjustment_PG')->where('person_id_PG',$id)->first();

        if ($request->status_PG1 != $statusGrund->status_PG){
            if ($statusGrund->status_PG == null){
                $todayG = $statusGrund->last_adjustment_PG;
            }else{
                $todayG = Carbon::now()->format('Y/m/d');
            }
        }else{
            $todayG = $statusGrund->last_adjustment_PG;
        }



        foreach (CostumerProduktGrundversicherung::where('person_id_PG',$id)->get() as $objekt){

select `status_PA`, `last_adjustment_PA` from `costumer_produkt_autoversicherung` where `person_id_PA` = 1 limit 1
---
            $famely->save();
        }

        $statusAuto = CostumerProduktAutoversicherung::select('status_PA','last_adjustment_PA')->where('person_id_PA',$id)->first();

select * from `costumer_produkt_autoversicherung` where `person_id_PA` = 1
---
        }

        $pcntt = 1;
        foreach (CostumerProduktAutoversicherung::where('person_id_PA',$id)->get() as $objekt){

select `status_PV`, `last_adjustment_PV` from `costumer_produkt_vorsorge` where `person_id_PV` = 1 limit 1
---
            Admins::find($familyperson)->notify(new SendNotificationn($url));
        }

        $statusVor = CostumerProduktVorsorge::select('status_PV','last_adjustment_PV')->where('person_id_PV',$id)->first();

update `costumer_produkt_vorsorge` set `graduation_date_PV` = '', `begin_PV` = '', `society_PV` = '', `pramie_PV` = '', `payment_rythm_PV` = '', `duration_from_PV` = '', `duration_to_PV` = '', `production_PV` = '', `status_PV` = 'Offen (Innendienst)', `last_adjustment_PV` = '2022-06-27', `total_commisions_PV` = 0, `costumer_produkt_vorsorge`.`updated_at` = '2022-06-27 12:03:07' where `person_id_PV` = 1
---
            $table_PV = 'status_PV';
        }

        $vorsorgeP = CostumerProduktVorsorge::where('person_id_PV',$id)->update([
            'graduation_date_PV'=> $request->graduation_date_PV,
            'begin_PV' => $request->begin_PV,
            'society_PV'=> filter_var($request->society_PV,FILTER_SANITIZE_STRING),
            'pramie_PV'=> filter_var($request->pramie_PV,FILTER_SANITIZE_STRING),
            'payment_rythm_PV'=> filter_var($request->payment_rythm_PV,FILTER_SANITIZE_STRING),
            'duration_from_PV'=>  $request->duration_from_PV,
            'duration_to_PV'=> $request->duration_to_PV,
            'production_PV'=> filter_var($request->production_PV,FILTER_SANITIZE_STRING),
             $table_PV => filter_var($request->status_PV,FILTER_SANITIZE_STRING),
            'last_adjustment_PV'=> $todayV,
            'total_commisions_PV'=> (int) filter_var($request->total_commisions_PV,FILTER_SANITIZE_STRING)
        ]);

select `status_PR`, `last_adjustment_PR` from `costumer_produkt_rechtsschutz` where `person_id_PR` = 1 limit 1
---
            $aufcnt++;
        }

        $statusRech = CostumerProduktRechtsschutz::select('status_PR','last_adjustment_PR')->where('person_id_PR',$id)->first();

update `costumer_produkt_rechtsschutz` set `graduation_date_PR` = '', `society_PR` = '', `produkt_PR` = '', `status_PR` = 'Offen (Innendienst)', `last_adjustment_PR` = '2022-06-27', `total_commisions_PR` = 0, `costumer_produkt_rechtsschutz`.`updated_at` = '2022-06-27 12:03:07' where `person_id_PR` = 1
---
            $table_PR = 'status_PR';
        }

        $retchsschutzP = CostumerProduktRechtsschutz::where('person_id_PR',$id)->update([
            'graduation_date_PR'=> $request->graduation_date_PR,
            'society_PR' => filter_var($request->society_PR,FILTER_SANITIZE_STRING),
            'produkt_PR'=> filter_var($request->produkt_PR,FILTER_SANITIZE_STRING),
            'status_PR' => 'Offen (Innendienst)',
            'last_adjustment_PR'=> $todayR,
            'total_commisions_PR'=> (int) filter_var($request->total_commisions_PR,FILTER_SANITIZE_STRING)
        ]);

select `status_PH`, `last_adjustment_PH` from `costumer_produkt_hausrat` where `person_id_PH` = 1 limit 1
---
            Admins::find($familyperson)->notify(new SendNotificationn($url));
        }

        $statusHaus = CostumerProduktHausrat::select('status_PH','last_adjustment_PH')->where('person_id_PH',$id)->first();

update `costumer_produkt_hausrat` set `society_PH` = '', `beginning_insurance_PH` = '', `insurance_PH` = '', `status_PH` = 'Offen (Innendienst)', `last_adjustment_PH` = '2022-06-27', `total_commisions_PH` = 0, `costumer_produkt_hausrat`.`updated_at` = '2022-06-27 12:03:07' where `person_id_PH` = 1
---
        }else{
            $table_PH = 'status_PH';
        }
        $hausratP = CostumerProduktHausrat::where('person_id_PH',$id)->update([
            'society_PH'=> filter_var($request->society_PH,FILTER_SANITIZE_STRING),
            'beginning_insurance_PH' => $request->beginning_insurance_PH,
            'insurance_PH'=> filter_var($request->insurance_PH,FILTER_SANITIZE_STRING),
             $table_PH => filter_var($request->status_PH,FILTER_SANITIZE_STRING),
            'last_adjustment_PH'=> $todayH,
            'total_commisions_PH'=> (int) filter_var($request->total_commisions_PH,FILTER_SANITIZE_STRING),
        ]);

select * from `pendencies` where `pendencies`.`id` = 1 and `pendencies`.`deleted_at` is null limit 1
---



        $pend = Pendency::find(Session::get('pend_id'));

select * from `lead_data_kk` where `person_id` = 1 order by `created_at` desc limit 1
---
        $personId = Crypt::decrypt($personId) / 1244;
        $offer = 0;

        $existingLeadDataKK = LeadDataKK::where('person_id', $personId)->latest()->first();

select * from `lead_data_fahrzeug` where `person_id` = 1 order by `created_at` desc limit 1
---
            $existingLeadDataCounterOffered->update($leadDataCounteroffered);
        }

        $existingLeadDataFahrzeug = LeadDataFahrzeug::where('person_id', $personId)->latest()->first();

update `lead_data_s` set `upload_file_vorsorge` = '1656331387_62b99c7b7d59a.jpg', `lead_data_s`.`updated_at` = '2022-06-27 12:03:07' where `id` = 1
select * from `lead_data_rech` where `person_id` = 1 order by `created_at` desc limit 1
---


        if ($existingLeadDataThings) {
            $existingLeadDataThings->update($leadDataThings);
        }

        $existingLeadDataRech = LeadDataRech::where('person_id',$personId)->latest()->first();

select * from `family_person` where `family_person`.`id` = 1 limit 1
select * from `pendencies` where `pendencies`.`id` = 1 and `pendencies`.`deleted_at` is null limit 1
---
        $bo = Admins::role(['backoffice','admin'])->get();

        foreach($bo as $b){
            $url =  '<a href="'  . route("leadfamilyperson",[Crypt::encrypt($personId * 1244),"admin_id" => Crypt::encrypt(Pendency::find($pend->id)->admin_id * 1244),"pend_id" => Pendency::find($pend->id)->id]) . '"> Dokumentation für :' . family::find($personId)->first_name . ' wurde eingereicht </a>';

select * from `family_person` where `family_person`.`id` = 1 limit 1
---
        }
        if($offer > 0){
            $url =  '<a href="'  . route("leadfamilyperson",[Crypt::encrypt($personId * 1244),"admin_id" => Crypt::encrypt(Pendency::find($pend->id)->admin_id * 1244),"pend_id" => Pendency::find($pend->id)->id]) . '"> Das erhaltene Angebot für den Kunden :' . family::find($personId)->first_name . ' wurde eingereicht </a>';
            Admins::find($pend->admin_id)->notify(new SendNotificationn($url));