app/Http/Controllers/StatisticController.php

select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Provisionert'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Aufgenommen'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Eingereicht'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Abgelehnt'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Offen (Berater)'
---
            if ($req->number == 0){
                $countProvisionert = CostumerProduktGrundversicherung::where('status_PG','Provisionert')->count() + CostumerProduktZusatzversicherung::where('status_PZ','Provisionert')->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Provisionert')->count() + CostumerProduktHausrat::where('status_PH','Provisionert')->count() + CostumerProduktVorsorge::where('status_PV','Provisionert')->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Provisionert')->count();
                $countAufgenommen = CostumerProduktGrundversicherung::where('status_PG','Aufgenommen')->count() + CostumerProduktZusatzversicherung::where('status_PZ','Aufgenommen')->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Aufgenommen')->count() + CostumerProduktHausrat::where('status_PH','Aufgenommen')->count() + CostumerProduktVorsorge::where('status_PV','Aufgenommen')->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Aufgenommen')->count();
                $countEingereicht = CostumerProduktGrundversicherung::where('status_PG','Eingereicht')->count() + CostumerProduktZusatzversicherung::where('status_PZ','Eingereicht')->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Eingereicht')->count() + CostumerProduktHausrat::where('status_PH','Eingereicht')->count() + CostumerProduktVorsorge::where('status_PV','Eingereicht')->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Eingereicht')->count();
                $countAbgelehnt = CostumerProduktGrundversicherung::where('status_PG','Abgelehnt')->count() + CostumerProduktZusatzversicherung::where('status_PZ','Abgelehnt')->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Abgelehnt')->count() + CostumerProduktHausrat::where('status_PH','Abgelehnt')->count() + CostumerProduktVorsorge::where('status_PV','Abgelehnt')->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Abgelehnt')->count();
                $countOffenBerater = CostumerProduktGrundversicherung::where('status_PG','Offen (Berater)')->count() + CostumerProduktZusatzversicherung::where('status_PZ','Offen (Berater)')->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Offen (Berater)')->count() + CostumerProduktHausrat::where('status_PH','Offen (Berater)')->count() + CostumerProduktVorsorge::where('status_PV','Offen (Berater)')->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Offen (Berater)')->count();

select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Provisionert' and `created_at` > '2022-02-20 12:42:21'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Aufgenommen' and `created_at` > '2022-02-20 12:42:21'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Eingereicht' and `created_at` > '2022-02-20 12:42:21'
---
                    + CostumerProduktAutoversicherung::where('status_PA','Aufgenommen')->whereBetween('created_at', [$dateFrom , $dateTo])->count();
                $countEingereicht = CostumerProduktGrundversicherung::where('status_PG','Eingereicht')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktZusatzversicherung::where('status_PZ','Eingereicht')->whereBetween('created_at', [$dateFrom , $dateTo])->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Eingereicht')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktHausrat::where('status_PH','Eingereicht')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktVorsorge::where('status_PV','Eingereicht')->whereBetween('created_at', [$dateFrom , $dateTo])->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Eingereicht')->whereBetween('created_at', [$dateFrom , $dateTo])->count();
                $countAbgelehnt = CostumerProduktGrundversicherung::where('status_PG','Abgelehnt')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktZusatzversicherung::where('status_PZ','Abgelehnt')->whereBetween('created_at', [$dateFrom , $dateTo])->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Abgelehnt')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktHausrat::where('status_PH','Abgelehnt')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktVorsorge::where('status_PV','Abgelehnt')->whereBetween('created_at', [$dateFrom , $dateTo])->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Abgelehnt')->whereBetween('created_at', [$dateFrom , $dateTo])->count();
                $countOffenBerater = CostumerProduktGrundversicherung::where('status_PG','Offen (Berater)')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktZusatzversicherung::where('status_PZ','Offen (Berater)')->whereBetween('created_at', [$dateFrom , $dateTo])->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Offen (Berater)')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktHausrat::where('status_PH','Offen (Berater)')->whereBetween('created_at', [$dateFrom , $dateTo])->count() + CostumerProduktVorsorge::where('status_PV','Offen (Berater)')->whereBetween('created_at', [$dateFrom , $dateTo])->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Offen (Berater)')->whereBetween('created_at', [$dateFrom , $dateTo])->count();

select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Offen (Berater)' and `created_at` > '2022-02-20 12:42:21'
---
            }else{
                $countProvisionert = CostumerProduktGrundversicherung::where('status_PG','Provisionert')->where('created_at', '>', $data)->count() + CostumerProduktZusatzversicherung::where('status_PZ','Provisionert')->where('created_at', '>', $data)->count()
                    + CostumerProduktRechtsschutz::where('status_PR','Provisionert')->where('created_at', '>', $data)->count() + CostumerProduktHausrat::where('status_PH','Provisionert')->where('created_at', '>', $data)->count() + CostumerProduktVorsorge::where('status_PV','Provisionert')->where('created_at', '>', $data)->count()
                    + CostumerProduktAutoversicherung::where('status_PA','Provisionert')->where('created_at', '>', $data)->count();

select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Provisionert'
select count(*) as aggregate from `costumer_produkt_rechtsschutz` where `status_PR` = 'Provisionert'
select count(*) as aggregate from `costumer_produkt_vorsorge` where `status_PV` = 'Provisionert'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Provisionert'
select count(*) as aggregate from `costumer_produkt_hausrat` where `status_PH` = 'Provisionert'
select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Provisionert' and `last_adjustment_PG` between '2022-06-14' and '2022-06-18'
select count(*) as aggregate from `costumer_produkt_rechtsschutz` where `status_PR` = 'Provisionert' and `last_adjustment_PR` between '2022-06-14' and '2022-06-18'
select count(*) as aggregate from `costumer_produkt_vorsorge` where `status_PV` = 'Provisionert' and `last_adjustment_PV` between '2022-06-14' and '2022-06-18'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Provisionert' and `last_adjustment_PA` between '2022-06-14' and '2022-06-18'
select count(*) as aggregate from `costumer_produkt_hausrat` where `status_PH` = 'Provisionert' and `last_adjustment_PH` between '2022-06-14' and '2022-06-18'
select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Provisionert' and `last_adjustment_PG` > '2022-06-14 15:05:04'
select count(*) as aggregate from `costumer_produkt_rechtsschutz` where `status_PR` = 'Provisionert' and `last_adjustment_PR` > '2022-06-14 15:05:04'
select count(*) as aggregate from `costumer_produkt_vorsorge` where `status_PV` = 'Provisionert' and `last_adjustment_PV` > '2022-06-14 15:05:04'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Provisionert' and `last_adjustment_PA` > '2022-06-14 15:05:04'
select count(*) as aggregate from `costumer_produkt_hausrat` where `status_PH` = 'Provisionert' and `last_adjustment_PH` > '2022-06-14 15:05:04'
---


        if($request->numberi == 0) {
            $grundversicherungP = CostumerProduktGrundversicherung::where('status_PG', 'Provisionert')->count();
            $retchsschutzP = CostumerProduktRechtsschutz::where('status_PR', 'Provisionert')->count();
            $vorsorgeP = CostumerProduktVorsorge::where('status_PV', 'Provisionert')->count();
            $zusatzversicherungP = CostumerProduktZusatzversicherung::where('status_PZ', 'Provisionert')->count();
            $autoversicherungP = CostumerProduktAutoversicherung::where('status_PA', 'Provisionert')->count();
            $hausratP = CostumerProduktHausrat::where('status_PH', 'Provisionert')->count();
        }elseif($request->numberi == 100){
            $grundversicherungP = CostumerProduktGrundversicherung::where('status_PG', 'Provisionert')->whereBetween('last_adjustment_PG',[$dateFrom , $dateTo])->count();
            $retchsschutzP = CostumerProduktRechtsschutz::where('status_PR', 'Provisionert')->whereBetween('last_adjustment_PR',[$dateFrom , $dateTo])->count();
            $vorsorgeP = CostumerProduktVorsorge::where('status_PV', 'Provisionert')->whereBetween('last_adjustment_PV',[$dateFrom , $dateTo])->count();
            $zusatzversicherungP = CostumerProduktZusatzversicherung::where('status_PZ', 'Provisionert')->whereBetween('last_adjustment_PZ',[$dateFrom , $dateTo])->count();
            $autoversicherungP = CostumerProduktAutoversicherung::where('status_PA', 'Provisionert')->whereBetween('last_adjustment_PA',[$dateFrom , $dateTo])->count();
            $hausratP = CostumerProduktHausrat::where('status_PH', 'Provisionert')->whereBetween('last_adjustment_PH',[$dateFrom , $dateTo])->count();
        }else{
            $grundversicherungP = CostumerProduktGrundversicherung::where('status_PG', 'Provisionert')->where('last_adjustment_PG', '>',$date)->count();
            $retchsschutzP = CostumerProduktRechtsschutz::where('status_PR', 'Provisionert')->where('last_adjustment_PR', '>',$date)->count();
            $vorsorgeP = CostumerProduktVorsorge::where('status_PV', 'Provisionert')->where('last_adjustment_PV', '>',$date)->count();
            $zusatzversicherungP = CostumerProduktZusatzversicherung::where('status_PZ', 'Provisionert')->where('last_adjustment_PZ', '>',$date)->count();
            $autoversicherungP = CostumerProduktAutoversicherung::where('status_PA', 'Provisionert')->where('last_adjustment_PA', '>',$date)->count();
            $hausratP = CostumerProduktHausrat::where('status_PH', 'Provisionert')->where('last_adjustment_PH', '>',$date)->count();

select * from `leads` where `completed` = '0' and `assigned` = 0 and `rejected` = 0 and `leads`.`deleted_at` is null
---
    public function statistics(){

        $leads['leads'] = lead::with('campaign')->where('completed', '0')->where('assigned', 0)->where('rejected',0)->get();

select count(*) as aggregate from `absences` where `description` <> 'Urlaub' and `description` <> 'Krankheit / Unfall' and `description` <> 'Weiterbildun' and `type` = 1
select count(*) as aggregate from `absences` where `description` = 'Krankheit / Unfall' and `type` = 1
select count(*) as aggregate from `absences` where `description` = 'Weiterbildun' and `type` = 1
---
    public function holidayReason(Request $req){
        $date = Carbon::now()->subDays($req->number);
        $holidays = collect();

        $dateFrom = date('Y-m-d', strtotime($req->dateFrom));
        $dateTo = date('Y-m-d', strtotime($req->dateTo));

        if(Auth::user()->hasRole('admin') || Auth::user()->hasRole('salesmanager') || Auth::user()->hasRole('backoffice')){
            if($req->number == 0){
                $holidaysUrlaub = Absence::where('description','Urlaub')->where('type',1)->count();
                $holidaysKrankheitUnfall = Absence::where('description','Krankheit / Unfall')->where('type',1)->count();
                $holidaysWeiterbildun = Absence::where('description','Weiterbildun')->where('type',1)->count();
                $holidaysOther = Absence::where('description','<>','Urlaub')->where('description','<>','Krankheit / Unfall')->where('description','<>','Weiterbildun')->where('type',1)->count();