app/Http/Controllers/StatisticController.php

select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Offen (Berater)' and `created_at` > '2022-02-20 12:42:21'
---

                $countTotal = collect([$countProvisionert,$countAufgenommen,$countEingereicht,$countAbgelehnt,$countOffenBerater]);
            }else{
                $countProvisionert = CostumerProduktGrundversicherung::where('status_PG','Provisionert')->where('created_at', '>', $data)->count() + CostumerProduktZusatzversicherung::where('status_PZ','Provisionert')->where('created_at', '>', $data)->count()