app/Http/Controllers/TasksController.php

select * from `leads` where `leads`.`id` in (1, 2, 3) and `leads`.`deleted_at` is null
---
                    $family->where('first_name', 'like', '%' . $searchname . '%');
                }
                if(isset($request->berater)){
                    $family->whereHas('lead',function($query) use($request){
                        $query->where('assign_to_id',$request->berater);
                    });