app/Http/Controllers/TodoController.php

select * from `to_do_lists` where `admin_id` = 1
---
    public function getToDo(){
        return ToDoList::where('admin_id',Auth::guard('admins')->user()->id)->get();