app/Http/Controllers/UserController.php

select * from `admins` where `admins`.`id` in (1, 4) and `admins`.`deleted_at` is null
---
    public function rejectlead(Request $request, $id)
    {
        $id = Crypt::decrypt($id) / 1244;

        $lead = lead::find($id);

        //$file = $request->file('begrundungfile2');
        $lead->begrundung = $request->begrundung;
        $lead->begrundung2 = $request->begrundung2;
        $lead->begrundungfile2 = $request->begrundungfile2 ? $this->storeFile($request->file('begrundungfile2'),'imgs') : null;
            //$this->storeFile($file, 'img');

        if($lead->save()){

			 Admins::role(['salesmanager'])->get()->each(function($item) use($lead){
                   $item->notify(new SendNotificationn('ein Begriff wurde von' . Admins::find($lead->assign_to_id)->name . 'abgelehnt'));
				 $lead->delete();
                });