app/Http/Controllers/UserController.php

select * from `campaigns` where `id` is null
---
    public function addappointment(\App\Http\Requests\Appointment $req)
    {

        $lead = new lead();
        $lead->agent = filter_var($req->input('agent'), FILTER_SANITIZE_STRING);
        $lead->berater = filter_var($req->input('berater'), FILTER_SANITIZE_STRING);
        $lead->first_name = filter_var($req->input('fname'), FILTER_SANITIZE_STRING);
        $lead->last_name = filter_var($req->input('lname'), FILTER_SANITIZE_STRING);
        $lead->telephone = filter_var($req->input('phone'), FILTER_SANITIZE_STRING);
        $lead->address = $req->input('address');
        $lead->birthdate = $req->input('birthdate');
        $lead->postal_code = filter_var($req->input('postal'), FILTER_SANITIZE_STRING);
        $lead->city =  $req->input('location');
        $lead->nr = filter_var($req->input('nr'),FILTER_SANITIZE_STRING);
        $lead->nationality = filter_var($req->input('country'), FILTER_SANITIZE_STRING);
        $lead->appointment_date = filter_var($req->input('appdate'), FILTER_SANITIZE_STRING);
        $lead->time = filter_var($req->input('apptime'), FILTER_SANITIZE_STRING);
        $lead->sprache = filter_var($req->input('sprache'), FILTER_SANITIZE_STRING);
        $lead->zufriedenheit = filter_var($req->input('zufriedenheit'), FILTER_SANITIZE_STRING);
        $lead->bemerkung = filter_var($req->input('bemerkung'), FILTER_SANITIZE_STRING);
        $lead->number_of_persons = (int)$req->input('count');
        $lead->campaign_id = (int)$req->input('campaign');
        $lead->assigned = 1;
        $campaign = campaigns::where('id', $req->input('campaign'))->get();

select * from `admins` where `admins`.`id` = '6' and `admins`.`deleted_at` is null limit 1
---
                $lead->assign_to_id = Auth::guard('admins')->user()->id;
            } else {
                if ($req->input('admin') != '') {
                    Admins::findorFail($req->input('admin'));

insert into `leads` (`agent`, `berater`, `first_name`, `last_name`, `telephone`, `address`, `postal_code`, `city`, `nr`, `nationality`, `appointment_date`, `time`, `sprache`, `zufriedenheit`, `bemerkung`, `number_of_persons`, `campaign_id`, `assigned`, `wantsonline`, `assign_to_id`, `latitude`, `longitude`, `updated_at`, `created_at`) values ('Russell Simmons', 'Karleigh Guzman', 'Rachel Payne', 'Bianca Manning', '59', 'Clinton Ferguson', '52', 'Damon Oliver', '75', 'Cherokee Powell', '2022-06-27', '19:15', 'Dara Jackson', 'Joel Hooper', 'Quae tempor consequa', 84, 0, 1, 0, 6, '0', '0', '2022-06-27 12:46:49', '2022-06-27 12:46:49')
---
        }


        if ($lead->save()) {

update `leads` set `slug` = 'rachel-payne-1', `leads`.`updated_at` = '2022-06-27 12:46:49' where `id` = 1
---
                $lead->assign_to_id = null;
            }
            $lead->slug = Str::slug(filter_var($req->input('fname'),FILTER_SANITIZE_STRING)) . '-' . $lead->id;
            $lead->save();

select * from `roles` where `roles`.`id` = 1 limit 1
select * from `admins` where `admins`.`id` = 4 and `admins`.`deleted_at` is null limit 1
---
    public function alead($id)
    {
        // $id = Crypt::decrypt($id) / 1244;

        if (lead::find($id)->assigned == 1 && lead::find($id)->assign_to_id != null) {
            return redirect()->back();
        } else {
            $role = Role::find(1);
            $admin = Admins::find(lead::find($id)->assign_to_id);

select * from `leads` where `leads`.`id` = 1 and `leads`.`deleted_at` is null limit 1
---
    public function updateperson(Request $req,$id){

        $person = family::find($id);
        $person->first_name = $req->first_name ? $req->first_name : $person->first_name;
        $person->last_name = $req->last_name ? $req->last_name : $person->last_name;
        $person->birthdate = $req->birthdate ? $req->birthdate : $person->birthdate;
        $person->save();

        $persons = lead::find($req->idLead);

insert into `pendencies` (`admin_id`, `family_id`, `p`, `updated_at`, `created_at`) values (1, 1, 0, '2022-06-27 11:33:05', '2022-06-27 11:33:05')
insert into `lead_data_kk` (`person_id`, `leads_id`, `updated_at`, `created_at`) values (1, 1, '2022-06-27 11:33:05', '2022-06-27 11:33:05')
insert into `lead_data_fahrzeug` (`person_id`, `leads_id`, `updated_at`, `created_at`) values (1, 1, '2022-06-27 11:33:05', '2022-06-27 11:33:05')
insert into `lead_data_s` (`person_id`, `leads_id`, `updated_at`, `created_at`) values (1, 1, '2022-06-27 11:33:05', '2022-06-27 11:33:05')
---
    public function completeapp(Request $req, $id)
    {
        $idd = Crypt::decrypt($id);
        $idd /= 1244;
        $lead = lead::find($idd);

        $cnt = $lead->number_of_persons;
        $pcnt = 0;
        for ($i = 1; $i <= $cnt; $i++) {
            if ($req->input('fname' . $i) != null && $req->input('birthday' . $i) != null && $req->input('lname' . $i) != null) {
                $family = new family();
                $family->first_name = filter_var($req->input('fname' . $i),FILTER_SANITIZE_STRING);
                $family->birthdate = filter_var($req->input('birthday' . $i),FILTER_SANITIZE_STRING);
                $family->last_name = filter_var($req->input('lname' . $i),FILTER_SANITIZE_STRING);
                $family->leads_id = (int) $idd;
                $family->status = "Done";
                $family->status_of_produkts = 'Offen (Berater)';
                $family->save();
                $pcnt++;
                Pendency::create(['admin_id' => auth()->user()->id,'family_id'=> $family->id,'p' => 0]);
                LeadDataKK::create(['person_id'=> $family->id,'leads_id'=> (int) $idd]);
                LeadDataFahrzeug::create(['person_id'=> $family->id,'leads_id'=> (int) $idd]);

select * from `admins` where `admins`.`id` in (1) and `admins`.`deleted_at` is null
---
    public function rejectlead(Request $request, $id)
    {
        $id = Crypt::decrypt($id) / 1244;

        $lead = lead::find($id);

        //$file = $request->file('begrundungfile2');
        $lead->begrundung = $request->begrundung;
        $lead->begrundung2 = $request->begrundung2;
        $lead->begrundungfile2 = $request->begrundungfile2 ? $this->storeFile($request->file('begrundungfile2'),'imgs') : null;
            //$this->storeFile($file, 'img');

        if($lead->save()){

			 Admins::role(['salesmanager'])->get()->each(function($item) use($lead){
                   $item->notify(new SendNotificationn('ein Begriff wurde von' . Admins::find($lead->assign_to_id)->name . 'abgelehnt'));
				 $lead->delete();
                });

select * from `pendencies` where `completed` = 0 and `p` = 0 and `pendencies`.`deleted_at` is null limit 20 offset 0
select count(*) as aggregate from `pendencies` where `completed` = 0 and `created_at` < '2022-06-13 14:37:54' and `p` = 1 and `pendencies`.`deleted_at` is null
select count(*) as aggregate from `pendencies` where `completed` = 0 and `created_at` < '2022-06-15 11:31:42' and `p` = 1 and `pendencies`.`deleted_at` is null
select * from `costumer_produkt_grundversicherung` where `status_PG` = 'Provisionert'
select * from `costumer_produkt_rechtsschutz` where `status_PR` = 'Provisionert'
select * from `costumer_produkt_vorsorge` where `status_PV` = 'Provisionert'
---
    public function dashboard(Request $req)
    {
        $user = auth()->user();

        $pendingg = Pendency::where('completed',0)
            ->with(['family', 'adminpend'])
            ->where('p',0)
            ->paginate(20,['*'],'pendP');

        $pendinggg = Pendency::where('completed',0)
            ->where('created_at','<',Carbon::now()->subDays(14))
            ->with(['family', 'adminpend'])
            ->where('p',1)
            ->paginate(20,['*'],'pendP');

        $urole = $user->getRoleNames()->toArray();

        $getmonth = isset($req->getmonth) ? $req->getmonth : "";
                $taskcnt = 0;
                date_default_timezone_set('Europe/Berlin');
                $provcnt = collect();
                //codi per statistics
                $grundversicherungP = CostumerProduktGrundversicherung::where('status_PG', 'Provisionert')->get()->each(function ($item) use ($provcnt){
                    if(!$provcnt->contains($item->person_id_PG)){
                        $provcnt->push($item->person_id_PG);
                    }
                });
                $retchsschutzP = CostumerProduktRechtsschutz::where('status_PR', 'Provisionert')->get()->each(function ($item) use ($provcnt){
                    if(!$provcnt->contains($item->person_id_PR)){
                        $provcnt->push($item->person_id_PR);
                    }
                });
                $vorsorgeP = CostumerProduktVorsorge::where('status_PV', 'Provisionert')->get()->each(function ($item) use ($provcnt){
                    if(!$provcnt->contains($item->person_id_PV)){
                        $provcnt->push($item->person_id_PV);
                    }
                });

select * from `costumer_produkt_autoversicherung` where `status_PA` = 'Provisionert'
select * from `costumer_produkt_hausrat` where `status_PH` = 'Provisionert'
---
                        $provcnt->push($item->person_id_PZ);
                    }
                });
                $autoversicherungP = CostumerProduktAutoversicherung::where('status_PA', 'Provisionert')->get()->each(function ($item) use ($provcnt){
                    if(!$provcnt->contains($item->person_id_PA)){
                        $provcnt->push($item->person_id_PA);
                    }
                });
                $hausratP = CostumerProduktHausrat::where('status_PH', 'Provisionert')->get()->each(function ($item) use ($provcnt){
                    if(!$provcnt->contains($item->person_id_PH)){
                        $provcnt->push($item->person_id_PH);
                    }
                });

select * from `costumer_produkt_grundversicherung` where `status_PG` = 'Eingereicht'
select * from `costumer_produkt_rechtsschutz` where `status_PR` = 'Eingereicht'
select * from `costumer_produkt_vorsorge` where `status_PV` = 'Eingereicht'
---
                ////////////////////////////
                $eingerichtcnt = collect();

                $grundversicherungP = CostumerProduktGrundversicherung::where('status_PG', 'Eingereicht')->get()->each(function ($item) use ($eingerichtcnt){
                    if(!$eingerichtcnt->contains($item->person_id_PG)){
                        $eingerichtcnt->push($item->person_id_PG);
                    }
                });
                $retchsschutzP = CostumerProduktRechtsschutz::where('status_PR', 'Eingereicht')->get()->each(function ($item) use ($eingerichtcnt){
                    if(!$eingerichtcnt->contains($item->person_id_PR)){
                        $eingerichtcnt->push($item->person_id_PR);
                    }
                });
                $vorsorgeP = CostumerProduktVorsorge::where('status_PV', 'Eingereicht')->get()->each(function ($item) use ($eingerichtcnt){
                    if(!$eingerichtcnt->contains($item->person_id_PV)){
                        $eingerichtcnt->push($item->person_id_PV);
                    }
                });

select * from `costumer_produkt_autoversicherung` where `status_PA` = 'Eingereicht'
select * from `costumer_produkt_hausrat` where `status_PH` = 'Eingereicht'
select * from `costumer_produkt_grundversicherung` where `status_PG` = 'Aufgenommen'
select * from `costumer_produkt_rechtsschutz` where `status_PR` = 'Aufgenommen'
select * from `costumer_produkt_vorsorge` where `status_PV` = 'Aufgenommen'
---
                        $eingerichtcnt->push($item->person_id_PZ);
                    }
                });
                $autoversicherungP = CostumerProduktAutoversicherung::where('status_PA', 'Eingereicht')->get()->each(function ($item) use ($eingerichtcnt){
                    if(!$eingerichtcnt->contains($item->person_id_PA)){
                        $eingerichtcnt->push($item->person_id_PA);
                    }
                });
                $hausratP = CostumerProduktHausrat::where('status_PH', 'Eingereicht')->get()->each(function ($item) use ($eingerichtcnt){
                    if(!$eingerichtcnt->contains($item->person_id_PH)){
                        $eingerichtcnt->push($item->person_id_PH);
                    }
                });

                //////////////////
                $aufgenomencnt = collect();
                $grundversicherungP = CostumerProduktGrundversicherung::where('status_PG', 'Aufgenommen')->get()->each(function ($item) use ($aufgenomencnt){
                    if(!$aufgenomencnt->contains($item->person_id_PG)){
                        $aufgenomencnt->push($item->person_id_PG);
                    }
                });
                $retchsschutzP = CostumerProduktRechtsschutz::where('status_PR', 'Aufgenommen')->get()->each(function ($item) use ($aufgenomencnt){
                    if(!$aufgenomencnt->contains($item->person_id_PR)){
                        $aufgenomencnt->push($item->person_id_PR);
                    }
                });
                $vorsorgeP = CostumerProduktVorsorge::where('status_PV', 'Aufgenommen')->get()->each(function ($item) use ($aufgenomencnt){
                    if(!$aufgenomencnt->contains($item->person_id_PV)){
                        $aufgenomencnt->push($item->person_id_PV);
                    }
                });

select * from `costumer_produkt_autoversicherung` where `status_PA` = 'Aufgenommen'
select * from `costumer_produkt_hausrat` where `status_PH` = 'Aufgenommen'
select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Offen (Berater)'
select count(*) as aggregate from `costumer_produkt_rechtsschutz` where `status_PR` = 'Offen (Berater)'
select count(*) as aggregate from `costumer_produkt_vorsorge` where `status_PV` = 'Offen (Berater)'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Offen (Berater)'
select count(*) as aggregate from `costumer_produkt_hausrat` where `status_PH` = 'Offen (Berater)'
select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Aufgenomen'
select count(*) as aggregate from `costumer_produkt_rechtsschutz` where `status_PR` = 'Aufgenomen'
select count(*) as aggregate from `costumer_produkt_vorsorge` where `status_PV` = 'Aufgenomen'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Aufgenomen'
select count(*) as aggregate from `costumer_produkt_hausrat` where `status_PH` = 'Aufgenomen'
select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Abgelehnt'
select count(*) as aggregate from `costumer_produkt_rechtsschutz` where `status_PR` = 'Abgelehnt'
select count(*) as aggregate from `costumer_produkt_vorsorge` where `status_PV` = 'Abgelehnt'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Abgelehnt'
select count(*) as aggregate from `costumer_produkt_hausrat` where `status_PH` = 'Abgelehnt'
select count(*) as aggregate from `costumer_produkt_grundversicherung` where `status_PG` = 'Zuruckgezogen'
select count(*) as aggregate from `costumer_produkt_rechtsschutz` where `status_PR` = 'Zuruckgezogen'
select count(*) as aggregate from `costumer_produkt_vorsorge` where `status_PV` = 'Zuruckgezogen'
select count(*) as aggregate from `costumer_produkt_autoversicherung` where `status_PA` = 'Zuruckgezogen'
select count(*) as aggregate from `costumer_produkt_hausrat` where `status_PH` = 'Zuruckgezogen'
---
                        $aufgenomencnt->push($item->person_id_PZ);
                    }
                });
                $autoversicherungP = CostumerProduktAutoversicherung::where('status_PA', 'Aufgenommen')->get()->each(function ($item) use ($aufgenomencnt){
                    if(!$aufgenomencnt->contains($item->person_id_PA)){
                        $aufgenomencnt->push($item->person_id_PA);
                    }
                });
                $hausratP = CostumerProduktHausrat::where('status_PH', 'Aufgenommen')->get()->each(function ($item) use ($aufgenomencnt){
                    if(!$aufgenomencnt->contains($item->person_id_PH)){
                        $aufgenomencnt->push($item->person_id_PH);
                    }
                });


                $grundversicherungOffen = CostumerProduktGrundversicherung::where('status_PG', 'Offen (Berater)')->count();
                $retchsschutzOffen = CostumerProduktRechtsschutz::where('status_PR', 'Offen (Berater)')->count();
                $vorsorgeOffen = CostumerProduktVorsorge::where('status_PV', 'Offen (Berater)')->count();
                $zusatzversicherungOffen = CostumerProduktZusatzversicherung::where('status_PZ', 'Offen (Berater)')->count();
                $autoversicherungOffen = CostumerProduktAutoversicherung::where('status_PA', 'Offen (Berater)')->count();
                $hausratOffen = CostumerProduktHausrat::where('status_PH', 'Offen (Berater)')->count();


                $grundversicherungAuf = CostumerProduktGrundversicherung::where('status_PG', 'Aufgenomen')->count();
                $retchsschutzAuf = CostumerProduktRechtsschutz::where('status_PR', 'Aufgenomen')->count();
                $vorsorgeAuf = CostumerProduktVorsorge::where('status_PV', 'Aufgenomen')->count();
                $zusatzversicherungAuf = CostumerProduktZusatzversicherung::where('status_PZ', 'Aufgenomen')->count();
                $autoversicherungAuf = CostumerProduktAutoversicherung::where('status_PA', 'Aufgenomen')->count();
                $hausratAuf = CostumerProduktHausrat::where('status_PH', 'Aufgenomen')->count();

                $grundversicherungA = CostumerProduktGrundversicherung::where('status_PG', 'Abgelehnt')->count();
                $retchsschutzA = CostumerProduktRechtsschutz::where('status_PR', 'Abgelehnt')->count();
                $vorsorgeA = CostumerProduktVorsorge::where('status_PV', 'Abgelehnt')->count();
                $zusatzversicherungA = CostumerProduktZusatzversicherung::where('status_PZ', 'Abgelehnt')->count();
                $autoversicherungA = CostumerProduktAutoversicherung::where('status_PA', 'Abgelehnt')->count();
                $hausratA = CostumerProduktHausrat::where('status_PH', 'Abgelehnt')->count();

                $grundversicherungZ = CostumerProduktGrundversicherung::where('status_PG', 'Zuruckgezogen')->count();
                $retchsschutzZ = CostumerProduktRechtsschutz::where('status_PR', 'Zuruckgezogen')->count();
                $vorsorgeZ = CostumerProduktVorsorge::where('status_PV', 'Zuruckgezogen')->count();
                $zusatzversicherungZ = CostumerProduktZusatzversicherung::where('status_PZ', 'Zuruckgezogen')->count();
                $autoversicherungZ = CostumerProduktAutoversicherung::where('status_PA', 'Zuruckgezogen')->count();
                $hausratZ = CostumerProduktHausrat::where('status_PH', 'Zuruckgezogen')->count();

select count(*) as aggregate from `pendencies` where `done` = 0 and `p` = 1 and `completed` = 0 and `pendencies`.`deleted_at` is null
---


                if (auth()->check()) {
                    $pendingcnt = !auth()->user()->hasRole('fs') ? Pendency::where('done',0)->where('p',1)->where('completed',0)
                        ->count() : Pendency::where('done',0)->where('completed',0)->where('admin_id',auth()->id())->where('p',1)->count();

select count(*) as aggregate from `family_person` inner join `pendencies` on `family_person`.`id` = `pendencies`.`family_id` where `done` = 1
---
                    if (in_array('backoffice',$urole) || in_array('admin',$urole) || in_array('salesmanager',$urole)) {
                        $pcnt = 0;
                        $mcnt = 0;
                        foreach (family::with('adminpend')
                                     ->join('pendencies', 'family_person.id', '=', 'pendencies.family_id')
                                     ->select('family_person.first_name', 'pendencies.family_id', 'family_person.id', 'family_person.last_name', 'pendencies.created_at', 'pendencies.done', 'pendencies.completed', 'pendencies.admin_id', 'pendencies.id as pid', 'pendencies.description','family_person.provisionert')
                                     ->orderBy('family_person.first_name', 'asc')
                                     ->where('done', 1)
                                     ->orderBy('pendencies.created_at','desc')
                                     ->paginate(50,'*','pendP') as $task) {

select * from `pendencies` where `pendencies`.`family_id` in (1, 2, 3) and `pendencies`.`deleted_at` is null
---
                            }

                        }
                        foreach (family::with(['pendency'])->get() as $f){

select count(*) as aggregate from `leads` where `completed` = '0'
select count(*) as aggregate from `family_person` inner join `pendencies` on `family_person`.`id` = `pendencies`.`family_id` where `pendencies`.`done` = 0
select count(*) as aggregate from `leads` where `completed` = '0' and `status_contract` != 'Done' or `status_contract` is null and `status_task` != 'Done'
select count(*) as aggregate from `family_person` inner join `pendencies` on `family_person`.`id` = `pendencies`.`family_id` where `pendencies`.`completed` = 1
---
                    if (in_array('fs',$urole) || in_array('admin',$urole) || in_array('salesmanager',$urole) || in_array('digital',$urole)) {
                        if (in_array('fs',$urole)) {
                            $pending = auth()->user()->pendencies()->where('done',0)->count();
                            $tasks = DB::table('leads')
                                ->where('completed', '=', '0')
                                ->count();
                            $done = auth()->user()->pendencies()->where('completed',1)->count();
                        } elseif (in_array('admin',$urole)) {
                            $pending = DB::table('family_person')
                                ->join('pendencies', 'family_person.id', '=', 'pendencies.family_id')
                                ->where('pendencies.done', '=', 0)
                                ->select('family_person.first_name as first_name', 'family_person.last_name as last_name', 'pendencies.*', 'family_person.id as id')
                                ->count();
                            $tasks = DB::table('leads')
                                ->where('completed', '=', '0')
                                ->where('status_contract', '!=', 'Done')
                                ->orWhereNull('status_contract')
                                ->where('status_task', '!=', 'Done')
                                ->count();
                            $done = DB::table('family_person')
                                ->join('pendencies', 'family_person.id', 'pendencies.family_id')
                                ->where('pendencies.completed', 1)
                                ->count();

select count(*) as aggregate from `leads` inner join `family_person` on `leads`.`id` = `family_person`.`leads_id` where `leads`.`assign_to_id` = 4 and `family_person`.`status` in ('Open')
select count(*) as aggregate from `leads` where `completed` = '0' and `deleted_at` is null and `assigned` = 0 and `leads`.`assign_to_id` = 4 and `wantsonline` = 0 and `rejected` = 0
select count(*) as aggregate from `family_person` inner join `leads` on `family_person`.`leads_id` = `leads`.`id` where `family_person`.`status` in ('Open') and `leads`.`assign_to_id` = 1
select count(*) as aggregate from `leads` where `assign_to_id` is null and `assigned` = 0 and `completed` = 0 and `rejected` = 0 and `wantsonline` = 0
---
                        }

                        if (in_array('fs',$urole)) {
                            $offen = DB::table('leads')
                            ->join('family_person','leads.id','family_person.leads_id')
                            ->where('leads.assign_to_id',$user->id)
                            ->whereIn('family_person.status',['Open'])
                            ->count();

                            $leadscount = $leadscount = DB::table('leads')->where('completed', '0')->where('deleted_at',null)->where('assigned', 0)->orderBy('updated_at', 'asc')->where('leads.assign_to_id', $user->id)->where('wantsonline', 0)->where('rejected', 0)->count();
                        } else {
                            $offen = DB::table('family_person')
                                ->join('leads', 'family_person.leads_id', '=', 'leads.id')
                                ->whereIn('family_person.status',['Open'])
                                ->where('leads.assign_to_id', $user->id)
                                ->count();

                            $leadscount = DB::table('leads')
                                ->whereNull('assign_to_id')
                                ->where('assigned', 0)->where('completed', 0)
                                ->where('rejected', 0)
                                ->where('wantsonline', 0)
                                ->count();

select * from `personalappointment` where `AppOrCon` = 1 and `assignfrom` = 1 and `date` >= '2022-06-29'
select * from `personalappointment` where `AppOrCon` = 2 and `date` >= '2022-06-29'
---

                        return view('dashboard', compact('user','admins','zusatzversicherungP','grundversicherungP','vorsorgeP','autoversicherungP','retchsschutzP','hausratP','adminsStat','urole','personalApp', 'consultation', 'done', 'tasks', 'pending', 'leadscount', 'todayAppointCount', 'percnt', 'pendencies', 'pendingcnt', 'morethan30', 'recorded', 'countpersonalApp', 'countconsultation', 'provisionertCount', 'offenCount', 'aufgenomenCount', 'zuruckCount', 'abgCount', 'offen','adminsStat'));
                    } elseif (in_array('admin',$urole)) {
                        $personalApp = PersonalAppointment::where('AppOrCon', 1)->where('assignfrom', $user->id)->where('date', '>=', Carbon::now()->format('Y-m-d'))->get();
                        $countpersonalApp = $personalApp->count();

                        $neww = PersonalAppointment::where('AppOrCon', 2)->where('date', '>=', Carbon::now()->format('Y-m-d'))->get()->unique('commen_id');

select * from `admins` where `admins`.`deleted_at` is null
---
                        });
                        $countconsultation = $consultation->count();

                        $admins =  Admins::all();