app/Models/Admins.php

select * from `groups` where `groups`.`id` = 0 limit 1
---
public function provision(){
    return $this->group->belongsTo(Provisions::class,'provision_id')->withDefault(['id'=>0]);