app/Models/data.php

select * from `lead_data_fahrzeug` where `person_id` = 4 limit 1
select * from `lead_data_kk` where `person_id` = 4 limit 1
select * from `lead_data_s` where `person_id` = 4 limit 1
select * from `lead_data_rech` where `person_id` = 4 limit 1
---
     public function getdata($id){
      $this->counter = LeadDataCounteroffered::where('person_id',$id)->first();
      $this->fahrzeug = LeadDataFahrzeug::where('person_id',$id)->first();

      $this->datakk = LeadDataKK::where('person_id',$id)->first();
      $this->prevention = LeadDataPrevention::where('person_id',$id)->first();
      $this->things = LeadDataThings::where('person_id',$id)->first();
      $this->rech = LeadDataRech::where('person_id', $id)->first();